app/controllers/campaigns_controller.rb

	def index
  		@campaigns = Campaign.where(user_id: current_user)
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = 1

  	def show
      camp_id = params[:id]
      @campaign = Campaign.find(params[:id])
  		@encounters = Encounter.where(campaign_id: camp_id)
      @players = Player.where(campaign_id: camp_id)
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]
SELECT "encounters".* FROM "encounters" WHERE "encounters"."campaign_id" = ?  [["campaign_id", 1]]
SELECT "players".* FROM "players" WHERE "players"."campaign_id" = ?  [["campaign_id", 1]]

	  def create
  		@campaign = Campaign.new(campaign_params)
  		if @campaign.save
---
INSERT INTO "campaigns" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "camp1"], ["description", "test camp"], ["user_id", 1], ["created_at", "2016-08-25 00:42:27.145462"], ["updated_at", "2016-08-25 00:42:27.145462"]]

  	def destroy
  		campaign = Campaign.find(params[:id])
  		campaign.destroy if campaign.user == current_user
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "campaigns" WHERE "campaigns"."id" = ?  [["id", 3]]