app/controllers/encounters_controller.rb

	def show
		encounter_id = params[:id]
		@encounter = Encounter.find(params[:id])
		@enemies = Enemy.where(encounter_id: encounter_id)
---
SELECT  "encounters".* FROM "encounters" WHERE "encounters"."id" = ? LIMIT 1  [["id", 1]]
SELECT "enemies".* FROM "enemies" WHERE "enemies"."encounter_id" = ?  [["encounter_id", 1]]

	def units
		encounter = Encounter.find(params[:encounter_id])
		camp = encounter.campaign
		@enemies = encounter.enemies
		@players = camp.players
		session[:camp] = encounter.campaign
		session[:units] = []
		session[:encounter] = encounter
		params.each do |player|
			creature = @players.find_by_name(player)
			if creature.nil? == false
		 		session[:units]<<{:name => creature[:name], :initiative => rand(1..20) + creature[:bonus]}
		 	end
		 end
		 @enemies.each do |enemy|
---
SELECT  "encounters".* FROM "encounters" WHERE "encounters"."id" = ? LIMIT 1  [["id", 1]]
SELECT "enemies".* FROM "enemies" WHERE "enemies"."encounter_id" = ?  [["encounter_id", 1]]

	def create
		@encounter = Encounter.new(encounter_params)
		if @encounter.save
---
INSERT INTO "encounters" ("name", "description", "campaign_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "encounter1"], ["description", "test"], ["campaign_id", 1], ["created_at", "2016-08-25 00:46:04.902026"], ["updated_at", "2016-08-25 00:46:04.902026"]]