app/controllers/enemies_controller.rb

	def create
		@enemy = Enemy.new(enemy_params)
		@enemy.active = true
		if @enemy.save
---
INSERT INTO "enemies" ("name", "notes", "bonus", "encounter_id", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "enemy3"], ["notes", "dragon"], ["bonus", 5], ["encounter_id", 1], ["active", "t"], ["created_at", "2016-08-25 16:57:06.838407"], ["updated_at", "2016-08-25 16:57:06.838407"]]

	def destroy
		Enemy.destroy(params[:id])
---
DELETE FROM "enemies" WHERE "enemies"."id" = ?  [["id", 2]]