app/controllers/players_controller.rb

	def edit
		@player = Player.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@player = Player.new(player_params)
		@player.active=true
		if @player.save
---
INSERT INTO "players" ("name", "notes", "bonus", "campaign_id", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Billy"], ["notes", "level 1 archer"], ["bonus", 3], ["campaign_id", 1], ["active", "t"], ["created_at", "2016-08-25 00:45:20.945275"], ["updated_at", "2016-08-25 00:45:20.945275"]]

	def destroy
		Player.destroy(params[:id])
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 5]]