app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["password_digest", "$2a$10$lpRbvyW6UF.KkwCxvjSV4OWcykW3/35coYU4QNQfDR1BcVNTClrCe"], ["created_at", "2016-08-25 00:41:49.159119"], ["updated_at", "2016-08-25 00:41:49.159119"]]